In [3]:
import pandas as pd 
import matplotlib.pyplot as plt
from datasets import load_dataset

# loading the data
dataset= load_dataset('lukebarousse/data_jobs')
df= dataset['train'].to_pandas()

# converting to the right time value

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\ekene\anaconda3\envs\python_project\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [ ]:
df_salary = df[pd.notna(df['salary_year_avg'])]

def projected_salary(salary):
    return salary * 1.03
    
df_salary['salary_inflated'] = df_salary['salary_year_avg'].apply(projected_salary).copy()

df_salary[['salary_year_avg', 'salary_inflated']]

C:\Users\ekene\AppData\Local\Temp\ipykernel_15516\4058486323.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_inflated'] = df_salary['salary_year_avg'].apply(projected_salary).copy()

        salary_year_avg  salary_inflated
28             109500.0        112785.00
77             140000.0        144200.00
92             120000.0        123600.00
100            228222.0        235068.66
109             89000.0         91670.00
...                 ...              ...
785624         139216.0        143392.48
785641         150000.0        154500.00
785648         221875.0        228531.25
785682         157500.0        162225.00
785692         157500.0        162225.00

[22003 rows x 2 columns]

In [7]:
df_salary['salary_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

df_salary[['salary_year_avg', 'salary_inflated']]

C:\Users\ekene\AppData\Local\Temp\ipykernel_15516\388983203.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)

        salary_year_avg  salary_inflated
28             109500.0        112785.00
77             140000.0        144200.00
92             120000.0        123600.00
100            228222.0        235068.66
109             89000.0         91670.00
...                 ...              ...
785624         139216.0        143392.48
785641         150000.0        154500.00
785648         221875.0        228531.25
785682         157500.0        162225.00
785692         157500.0        162225.00

[22003 rows x 2 columns]

## converting job skills list from string data type to list data type, as it should be

In [11]:
# checking the job_skills column 
df['job_skills'][1]

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [ ]:
type(df['job_skills'][1])

str

In [ ]:
import ast   # this function is used to convert strings into list or so

ast.literal_eval(df['job_skills'][1])

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']

In [18]:
# check
type(df['job_skills'][1])

str

In [26]:
import ast

type(ast.literal_eval(df['job_skills'][1]))

list

In [23]:
type(df['job_skills'][785739])

str

In [25]:
type(ast.literal_eval(df['job_skills'][785739]))

list

In [27]:
# using lambda
df['job_skills'] = df['job_skills'].apply(lambda skills : ast.literal_eval(skills) if pd.notna(skills) else skills)

In [29]:
# inspecting 
type(df['job_skills'][1])

list

In [31]:
# say inflation affects senior roles salaries by 5% and junior roles by 3%
# we want to use the apply function on rows, affecting multiple columns

def projected_pay(rows):
    if 'senior' in rows['job_title_short']:
     return 1.05 * rows['salary_year_avg']
    else: 
       return  1.03 * rows['salary_year_avg']
    
df_salary['salary_inflated'] = df_salary.apply(projected_pay, axis = 1 )

df_salary[['job_title_short', 'salary_year_avg', 'salary_inflated']]

C:\Users\ekene\AppData\Local\Temp\ipykernel_15516\1604784648.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_inflated'] = df_salary.apply(projected_pay, axis = 1 )

       job_title_short  salary_year_avg  salary_inflated
28      Data Scientist         109500.0        112785.00
77       Data Engineer         140000.0        144200.00
92       Data Engineer         120000.0        123600.00
100     Data Scientist         228222.0        235068.66
109       Data Analyst          89000.0         91670.00
...                ...              ...              ...
785624   Data Engineer         139216.0        143392.48
785641   Data Engineer         150000.0        154500.00
785648  Data Scientist         221875.0        228531.25
785682  Data Scientist         157500.0        162225.00
785692  Data Scientist         157500.0        162225.00

[22003 rows x 3 columns]

In [34]:
# with lambda
df_salary['salary_inflated'] = df_salary.apply(lambda rows: 1.05 * rows['salary_year_avg'] if 'senior' in rows['job_title_short'] else 1.03 * rows['salary_year_avg'], axis= 1)

df_salary[['job_title_short', 'salary_year_avg', 'salary_inflated']].sample(10)

C:\Users\ekene\AppData\Local\Temp\ipykernel_15516\2991550940.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary['salary_inflated'] = df_salary.apply(lambda rows: 1.05 * rows['salary_year_avg'] if 'senior' in rows['job_title_short'] else 1.03 * rows['salary_year_avg'], axis= 1)

             job_title_short  salary_year_avg  salary_inflated
630140        Data Scientist         245000.0         252350.0
769655        Data Scientist         115000.0         118450.0
732367          Data Analyst         110000.0         113300.0
205708  Senior Data Engineer         135000.0         139050.0
561120        Data Scientist         119500.0         123085.0
277208        Data Scientist         125000.0         128750.0
320465          Data Analyst          95500.0          98365.0
458541         Data Engineer         110000.0         113300.0
754927        Data Scientist          80000.0          82400.0
124312          Data Analyst         136400.0         140492.0

practice sums

In [5]:
import pandas as pd


data = {
    'Name': ['john doe', 'jane SMITH', 'ALICE Brown'],
    'Salary': [50000, 60000, 70000],
    'Department': ['HR', 'IT', 'Finance']
}

df= pd.DataFrame(data)

# Standardize names (capitalize the first letter of each name).
# Apply a 10% increase to salaries.
# using the .apply function

df['Name'] = df['Name'].apply(lambda x: x.title())
df['Salary'] = df['Salary'].apply(lambda x: x*1.1)

df

          Name   Salary Department
0     John Doe  55000.0         HR
1   Jane Smith  66000.0         IT
2  Alice Brown  77000.0    Finance

In [6]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Salary': [70000, 80000, 90000],
    'Department': ['Finance', 'HR', 'IT']
})

# Merge them using .concat() on EmployeeID and show all columns

pd.concat([df1.set_index('EmployeeID'), df2.set_index('EmployeeID')], axis= 1).reset_index()

   EmployeeID     Name  Salary Department
0           1    Alice   70000    Finance
1           2      Bob   80000         HR
2           3  Charlie   90000         IT

In [5]:
# calculate the FinalPrice by subtracting the discount from the price.
import pandas as pd
data = {
    'Product': ['A', 'B', 'C'],
    'Price': [100, 200, 300],
    'Discount': [10, 20, 30]}

df = pd.DataFrame(data)

df

  Product  Price  Discount
0       A    100        10
1       B    200        20
2       C    300        30

In [8]:
df['FinalPrice'] = df.apply(lambda row: row['Price'] - row['Discount'], axis= 1)

df['FinalPrice']

0     90
1    180
2    270
Name: FinalPrice, dtype: int64

In [9]:
df

  Product  Price  Discount  FinalPrice
0       A    100        10          90
1       B    200        20         180
2       C    300        30         270